# generated by autoeda
# set clock period
set clk_main_period 10
# clk define
create_clock -period $clk_main_period -name "main_clk" [get_ports {clk}]
set_clock_uncertainty -setup 1 [get_clocks main_clk]
set_clock_uncertainty -hold  1 [get_clocks main_clk]

# add port
set_input_delay  -max [expr ($clk_main_period*0.4)] -clock main_clk [get_ports { rst_n config_req config_data[0] config_data[1] config_data[2] config_data[3] config_data[4] config_data[5] }]
set_input_delay  -min 0                             -clock main_clk [get_ports { rst_n config_req config_data[0] config_data[1] config_data[2] config_data[3] config_data[4] config_data[5] }]
set_output_delay -max [expr ($clk_main_period*0.4)] -clock main_clk [get_ports { cpol cpha spi_width[0] spi_width[1] spi_width[2] spi_width[3] }]
set_output_delay -min 0                             -clock main_clk [get_ports { cpol cpha spi_width[0] spi_width[1] spi_width[2] spi_width[3] }]

